In [2]:
import pandas as pd
import numpy as np

In [4]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [9]:
#Creating a Dictionary using Arrays.
#Arrays created by NumPy. Please look at above the code.

dictionary = {"variable_1" : s1, 
              "variable_2" : s2,
              "variable_3" : s3 }

In [18]:
#To show Dictionary. 
#(in .py ext. files, please use `print` command.)
#Example: print(dictionary)
dictionary

{'variable_1': array([2, 0, 5, 0, 6]),
 'variable_2': array([2, 2, 4, 5, 9]),
 'variable_3': array([6, 4, 1, 3, 8])}

In [14]:
#Creating DataFrame from Dictionary
#Giving name for DataFrame
df = pd.DataFrame(dictionary)

In [19]:
#To show DataFrame (using variable df)
#(in .py ext. files, please use `print` command)
#Example: print(df)
df

   variable_1  variable_2  variable_3
0           2           2           6
1           0           2           4
2           5           4           1
3           0           5           3
4           6           9           8

In [21]:
#To have info about DataFrame index
df.index

RangeIndex(start=0, stop=5, step=1)

# **Some Special Process with Index:**

In [24]:
#Elements are which are zero to one (index nums)
df[0:1]

   variable_1  variable_2  variable_3
0           2           2           6

**Changing Index Names / Values in DataFrame:**

In [25]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [26]:
#Change Index Values / Names
df.index = ["a","b","c","d","e"]

In [30]:
#To show the changed DataFrame
df

   variable_1  variable_2  variable_3
a           2           2           6
b           0           2           4
c           5           4           1
d           0           5           3
e           6           9           8

In [32]:
#To show DataFrame from b to d (index)
df["b":"d"]

   variable_1  variable_2  variable_3
b           0           2           4
c           5           4           1
d           0           5           3

**Removing Columns & Rows in DataFrame:**

In [33]:
df.drop("a",axis = 0)

   variable_1  variable_2  variable_3
b           0           2           4
c           5           4           1
d           0           5           3
e           6           9           8

In [35]:
df

   variable_1  variable_2  variable_3
a           2           2           6
b           0           2           4
c           5           4           1
d           0           5           3
e           6           9           8

`df.drop` is removing rows **temporarily**. If you want to **remove the colums permanent from pandas dataframe**, you can use the `inplace` command.

Here is the example for `inplace`:

In [36]:
df.drop("a",axis = 0, inplace = True)

In [37]:
df

   variable_1  variable_2  variable_3
b           0           2           4
c           5           4           1
d           0           5           3
e           6           9           8

As you see the above on this row, the rows are removed from DataFrame Permanent.

In [38]:
#Removing Indexes with using Fancy Index

In [39]:
l = ["c","e"] 
#We're giving the index 
#which are wants remove
#to variable l.
#We're storing the indexes values in a list.

In [40]:
df.drop(l, axis=0)

   variable_1  variable_2  variable_3
b           0           2           4
d           0           5           3

In [43]:
#Removing Process for Columns / Variables

In [48]:
df

   variable_1  variable_2  variable_3
b           0           2           4
c           5           4           1
d           0           5           3
e           6           9           8

In [49]:
#Some examples are here:

In [46]:
"var1" in df

False

In [47]:
"variable_1" in df

True

**Extra:** With using fancy indexes, we can surfing the all dataframe
with special selected many column names. 
**Example:**

In [52]:
#Creating an array.
l = ["variable_1","variable_2","var3"]

In [53]:
#Surfing the DataFrame with L Elements.
for i in l:
    print(i in df)

True
True
False

In [54]:
#Hasan Baris GOK from Data Manipulation 201 Pandas Directory on GitHub.